Autodesk.Revit.DB.ShellLayerType
Used to distinguish exterior and interior shell layers.
Remarks:
Used as an argument to methods of CompoundStructure that deal with shell layers.
Since:
2012

Autodesk.Revit.DB.ShellLayerType.Exterior
Exterior shell layer.

Autodesk.Revit.DB.ShellLayerType.Interior
Interior shell layer.